{
  "title": "True Representation of Your QA data",
  "titleDes": "Don't be a victim of Fake Test Results like NASA!!",
  "titleImg": "fakeresults.jpg",
  "paragraph": [{
      "paraTitle": "",
      "paraContent": "NASA revealed the reason behind the failure of two of its satellite launches and the reason behind the failure was the approval taken by wrong means. A metals manufacturer faked test results and provided faulty materials to NASA, causing more than $700 million (roughly Rs. 4,900 crores) in losses and two failed satellite launch missions, according to an investigation by the US space agency. Similarly, the false QA reports generated by QA team affects the application which is installed on the production environment.",
      "paraImg": "",
      "imgHeight": "",
      "imgWidth": ""
    },
    {
      "paraTitle": "",
      "paraContent": "With Pintailer, you don't have to be a victim anymore. Maintain 100% transparency with test automation tracking and management of your test cases with effective fault-free test results of test coverage, test execution, and QA Progress.",
      "paraImg": "fakeresults1.png",
      "imgHeight": "",
      "imgWidth": ""
    },
    {
      "paraTitle": "Interactive Reporting",
      "paraContent": "There are many types of reports available in Pintailer - Test Execution Report, Test Coverage Report and QA Progress Reports. View consolidated Test Coverage and Execution Reports i.e. single report for all your Manual as well as Automation Test creation and Execution.",
      "paraImg": "",
      "imgHeight": "",
      "imgWidth": ""
    },
    {
      "paraTitle": "1. Test Coverage Report",
      "paraContent": "Get a glimpse of the number of Test cases which are automatable or non-automatable. Also, know out of the automatable test cases how many are already automated and how many are pending.",
      "paraImg": "",
      "imgHeight": "",
      "imgWidth": ""
    },
    {
      "paraTitle": "2. Daily/Weekly Status Reports",
      "paraContent": "Get daily/weekly status reports via E-mail based on your need. With these reports know the Testing status on a daily/weekly basis and track your automation progress.",
      "paraImg": "",
      "imgHeight": "",
      "imgWidth": ""
    },
    {
      "paraTitle": "3. Individual QA Status Report",
      "paraContent": "Know the status of the progress done on Test automation by individual QA team member",
      "paraImg": "",
      "imgHeight": "",
      "imgWidth": ""
    },
    {
      "paraTitle": "",
      "paraContent": "The prime reason why you can't falsify the test results in PINTAILER is that every automated test case is mapped with its test steps and if the mapping isn't there then you can't mark the test case Passed.",
      "paraImg": "",
      "imgHeight": "",
      "imgWidth": ""
    },
    {
      "paraTitle": "",
      "paraContent": "And even if some parts of the test scripts/cases are commented/removed before test execution then PINTAILER will identify them as \"Not Executed\" because the mapping already exists in the system for those parts of test scripts/cases.",
      "paraImg": "",
      "imgHeight": "",
      "imgWidth": ""
    },
    {
      "paraTitle": "Test Automation Tracking",
      "paraContent": "Mapping of Test Cases with Manual Test Cases and Releases enables you to track the progress of the overall Test Automation effort.",
      "paraImg": "",
      "imgHeight": "",
      "imgWidth": ""
    },
    {
      "paraTitle": "Test Case Management",
      "paraContent": "Ease of Viewing, Editing, Updating and Managing your manual (Cucumber implementation only) into the system. It automatically creates their respective manual test cases with the interactive User Interface. Pintailer enables adding projects that have automation scripts/manual test cases and includes them into Coverage and Execution reports.",
      "paraImg": "fakeresults2.png",
      "imgHeight": "",
      "imgWidth": ""
    },
    {
      "paraTitle": "",
      "paraContent": "In case if you are wondering about taking on a tedious project of transitioning from Excel or another repository, don't worry Pintailer has got you all covered. Don't wait like NASA to turn back the hands of the time before its too late.",
      "paraImg": "",
      "imgHeight": "",
      "imgWidth": ""
    },
    {
      "paraTitle": "",
      "paraContent": "To register for a demo, click on the <a href='http://pintailer.com/'>Link</a>",
      "paraImg": "",
      "imgHeight": "",
      "imgWidth": ""
    }
  ]
}
